ChangXiaoxin/Stellar-M3_Epaper/simplelink_cc2640r2_sdk_5_30_00_03/source/ti/boards/CC2640R2_STELLAR_M3/CC2640R2_STELLAR_M3.c
const uint_least8_t ADC_count = CC2640R2_STELLAR_M3_ADCCOUNT;

/*
 *  =============================== Crypto ===============================
 */
#include <ti/drivers/crypto/CryptoCC26XX.h>

CryptoCC26XX_Object cryptoCC26XXObjects[CC2640R2_STELLAR_M3_CRYPTOCOUNT];

const CryptoCC26XX_HWAttrs cryptoCC26XXHWAttrs[CC2640R2_STELLAR_M3_CRYPTOCOUNT] = {
    {
        .baseAddr       = CRYPTO_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_CRYPTO,
        .intNum         = INT_CRYPTO_RESULT_AVAIL_IRQ,
        .intPriority    = ~0,
    }
};

const CryptoCC26XX_Config CryptoCC26XX_config[CC2640R2_STELLAR_M3_CRYPTOCOUNT] = {
    {
         .object  = &cryptoCC26XXObjects[CC2640R2_STELLAR_M3_CRYPTO0],
         .hwAttrs = &cryptoCC26XXHWAttrs[CC2640R2_STELLAR_M3_CRYPTO0]
    },
};

/*
 *  =============================== AESCCM ===============================
 */
#include <ti/drivers/AESCCM.h>
#include <ti/drivers/aesccm/AESCCMCC26XX.h>

AESCCMCC26XX_Object aesccmCC26XXObjects[CC2640R2_STELLAR_M3_AESCCMCOUNT];

const AESCCMCC26XX_HWAttrs aesccmCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESCCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCCM_Config AESCCM_config[CC2640R2_STELLAR_M3_AESCCMCOUNT] = {
    {
         .object  = &aesccmCC26XXObjects[CC2640R2_STELLAR_M3_AESCCM0],
         .hwAttrs = &aesccmCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESCCM0]
    },
};

const uint_least8_t AESCCM_count = CC2640R2_STELLAR_M3_AESCCMCOUNT;


/*
 *  =============================== AESGCM ===============================
 */
#include <ti/drivers/AESGCM.h>
#include <ti/drivers/aesgcm/AESGCMCC26XX.h>

AESGCMCC26XX_Object aesgcmCC26XXObjects[CC2640R2_STELLAR_M3_AESGCMCOUNT];

const AESGCMCC26XX_HWAttrs aesgcmCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESGCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESGCM_Config AESGCM_config[CC2640R2_STELLAR_M3_AESGCMCOUNT] = {
    {
         .object  = &aesgcmCC26XXObjects[CC2640R2_STELLAR_M3_AESGCM0],
         .hwAttrs = &aesgcmCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESGCM0]
    },
};

const uint_least8_t AESGCM_count = CC2640R2_STELLAR_M3_AESGCMCOUNT;

/*
 *  =============================== AESCBC ===============================
 */
#include <ti/drivers/AESCBC.h>
#include <ti/drivers/aescbc/AESCBCCC26XX.h>

AESCBCCC26XX_Object aescbcCC26XXObjects[CC2640R2_STELLAR_M3_AESCBCCOUNT];

const AESCBCCC26XX_HWAttrs aescbcCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESCBCCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCBC_Config AESCBC_config[CC2640R2_STELLAR_M3_AESCBCCOUNT] = {
    {
         .object  = &aescbcCC26XXObjects[CC2640R2_STELLAR_M3_AESCBC0],
         .hwAttrs = &aescbcCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESCBC0]
    },
};

const uint_least8_t AESCBC_count = CC2640R2_STELLAR_M3_AESCBCCOUNT;

/*
 *  =============================== AESCTR ===============================
 */
#include <ti/drivers/AESCTR.h>
#include <ti/drivers/aesctr/AESCTRCC26XX.h>

AESCTRCC26XX_Object aesctrCC26XXObjects[CC2640R2_STELLAR_M3_AESCTRCOUNT];

const AESCTRCC26XX_HWAttrs aesctrCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESCTRCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCTR_Config AESCTR_config[CC2640R2_STELLAR_M3_AESCTRCOUNT] = {
    {
         .object  = &aesctrCC26XXObjects[CC2640R2_STELLAR_M3_AESCTR0],
         .hwAttrs = &aesctrCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESCTR0]
    },
};

const uint_least8_t AESCTR_count = CC2640R2_STELLAR_M3_AESCTRCOUNT;

/*
 *  =============================== AESECB ===============================
 */
#include <ti/drivers/AESECB.h>
#include <ti/drivers/aesecb/AESECBCC26XX.h>

AESECBCC26XX_Object aesecbCC26XXObjects[CC2640R2_STELLAR_M3_AESECBCOUNT];

const AESECBCC26XX_HWAttrs aesecbCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESECBCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESECB_Config AESECB_config[CC2640R2_STELLAR_M3_AESECBCOUNT] = {
    {
         .object  = &aesecbCC26XXObjects[CC2640R2_STELLAR_M3_AESECB0],
         .hwAttrs = &aesecbCC26XXHWAttrs[CC2640R2_STELLAR_M3_AESECB0]
    },
};

const uint_least8_t AESECB_count = CC2640R2_STELLAR_M3_AESECBCOUNT;

/*
 *  =============================== AESCTRDRBG ===============================
 */
#include <ti/drivers/AESCTRDRBG.h>
#include <ti/drivers/aesctrdrbg/AESCTRDRBGXX.h>

AESCTRDRBGXX_Object aesctrdrbgXXObjects[CC2640R2_STELLAR_M3_AESCTRDRBGCOUNT];

const AESCTRDRBGXX_HWAttrs aesctrdrbgXXHWAttrs[CC2640R2_STELLAR_M3_AESCTRDRBGCOUNT] = {
    {
        .aesctrIndex       = CC2640R2_STELLAR_M3_AESCTR0,
    }
};

const AESCTRDRBG_Config AESCTRDRBG_config[CC2640R2_STELLAR_M3_AESCTRDRBGCOUNT] = {
    {
         .object  = &aesctrdrbgXXObjects[CC2640R2_STELLAR_M3_AESCTRDRBG0],
         .hwAttrs = &aesctrdrbgXXHWAttrs[CC2640R2_STELLAR_M3_AESCTRDRBG0]
    },
};

const uint_least8_t AESCTRDRBG_count = CC2640R2_STELLAR_M3_AESCTRDRBGCOUNT;

/*
 *  =============================== Display ===============================
 */
#include <ti/display/Display.h>
#include <ti/display/DisplayUart.h>
#include <ti/display/DisplaySharp.h>

#ifndef BOARD_DISPLAY_UART_STRBUF_SIZE
#define BOARD_DISPLAY_UART_STRBUF_SIZE    128
#endif

/* This value can be changed to 96 for use with the 430BOOST-SHARP96 BoosterPack. */
#define BOARD_DISPLAY_SHARP_SIZE    128

DisplayUart_Object     displayUartObject;
DisplaySharp_Object    displaySharpObject;

static char uartStringBuf[BOARD_DISPLAY_UART_STRBUF_SIZE];
static uint_least8_t sharpDisplayBuf[BOARD_DISPLAY_SHARP_SIZE * BOARD_DISPLAY_SHARP_SIZE / 8];

const DisplayUart_HWAttrs displayUartHWAttrs = {
    .uartIdx      = CC2640R2_STELLAR_M3_UART0,
    .baudRate     = 115200,
    .mutexTimeout = (unsigned int)(-1),
    .strBuf       = uartStringBuf,
    .strBufLen    = BOARD_DISPLAY_UART_STRBUF_SIZE,
};

const DisplaySharp_HWAttrsV1 displaySharpHWattrs = {
    .spiIndex    = CC2640R2_STELLAR_M3_SPI0,
    .csPin       = CC2640R2_STELLAR_M3_GPIO_LCD_CS,
    .powerPin    = CC2640R2_STELLAR_M3_GPIO_LCD_POWER,
    .enablePin   = CC2640R2_STELLAR_M3_GPIO_LCD_ENABLE,
    .pixelWidth  = BOARD_DISPLAY_SHARP_SIZE,
    .pixelHeight = BOARD_DISPLAY_SHARP_SIZE,
    .displayBuf  = sharpDisplayBuf,
};

#ifndef BOARD_DISPLAY_USE_UART
#define BOARD_DISPLAY_USE_UART 1
#endif
#ifndef BOARD_DISPLAY_USE_UART_ANSI
#define BOARD_DISPLAY_USE_UART_ANSI 0
#endif
#ifndef BOARD_DISPLAY_USE_LCD
#define BOARD_DISPLAY_USE_LCD 0
#endif

