ChangXiaoxin/Stellar-M3_Epaper/simplelink_cc2640r2_sdk_5_30_00_03/source/ti/boards/CC2640R2_STELLAR_M3/CC2640R2_STELLAR_M3.c
/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
#ifdef USE_RCOSC
    .calibrateRCOSC_LF  = true,
#else
    .calibrateRCOSC_LF  = false,
#endif
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWMCOUNT] = {
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN0, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER0A },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN1, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER0B },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN2, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER1A },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN3, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER1B },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN4, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER2A },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN5, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER2B },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN6, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER3A },
    { .pwmPin = CC2640R2_STELLAR_M3_PWMPIN7, .gpTimerUnit = CC2640R2_STELLAR_M3_GPTIMER3B },
};

const PWM_Config PWM_config[CC2640R2_STELLAR_M3_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM0], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM1], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM2], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM3], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM4], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM5], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM6], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_STELLAR_M3_PWM7], &pwmtimerCC26xxHWAttrs[CC2640R2_STELLAR_M3_PWM7] },
};

const uint_least8_t PWM_count = CC2640R2_STELLAR_M3_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,       /* Lowest HWI priority */
    .swiPriority        = 0,        /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,     /* Keep XOSC dependency while in standby */
    .globalCallback     = NULL,     /* No board specific callback */
    .globalEventMask    = 0         /* No events subscribed to */
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[CC2640R2_STELLAR_M3_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC2640R2_STELLAR_M3_SDCOUNT] = {
    {
        .spiIndex = CC2640R2_STELLAR_M3_SPI0,
        .spiCsGpioIndex = CC2640R2_STELLAR_M3_SDSPI_CS
    }
};

const SD_Config SD_config[CC2640R2_STELLAR_M3_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC2640R2_STELLAR_M3_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC2640R2_STELLAR_M3_SDSPI0]
    },
};

const uint_least8_t SD_count = CC2640R2_STELLAR_M3_SDCOUNT;

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC2640R2_STELLAR_M3_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC2640R2_STELLAR_M3_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC2640R2_STELLAR_M3_SPI0_MOSI,
        .misoPin            = CC2640R2_STELLAR_M3_SPI0_MISO,
        .clkPin             = CC2640R2_STELLAR_M3_SPI0_CLK,
        .csnPin             = CC2640R2_STELLAR_M3_SPI0_CSN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC2640R2_STELLAR_M3_SPI1_MOSI,
        .misoPin            = CC2640R2_STELLAR_M3_SPI1_MISO,
        .clkPin             = CC2640R2_STELLAR_M3_SPI1_CLK,
        .csnPin             = CC2640R2_STELLAR_M3_SPI1_CSN,
        .minDmaTransferSize = 10
    }
};

const SPI_Config SPI_config[CC2640R2_STELLAR_M3_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC2640R2_STELLAR_M3_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC2640R2_STELLAR_M3_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC2640R2_STELLAR_M3_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC2640R2_STELLAR_M3_SPI1]
    },
};

const uint_least8_t SPI_count = CC2640R2_STELLAR_M3_SPICOUNT;

